In [6]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\svish\anaconda3\lib\site-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\svish\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.5)

In [3]:
import mysql.connector as connection

try :
    mydb = connection.connect(host = "localhost",database = 'lco_users',user = "root",passwd = "Vishal@9850",use_pure = True )

    #check if the connection is established

    query = "SHOW DATABASES"
    cursor = mydb.cursor()
    cursor.execute(query)
    print(cursor.fetchall())

except Exception as e:
    mydb.close()
    print(str(e))

[('information_schema',), ('lco_users',), ('mysql',), ('performance_schema',), ('photo_store',), ('sakila',), ('sample',), ('sys',), ('vishal123',), ('world',)]

In [8]:
import pandas as pd

In [17]:
a = pd.read_sql("select * from students",mydb)
a

,id,email,first_name,last_name,login_count,course_count,signup_month
0,1,vp@gmail.com,Vishal,Pawar,110,10,JAN
1,2,rt@yahoo.com,Radhika,Tuwar,50,5,MAR
2,3,ac@hotmail.com,Anita,Chavan,190,25,JULY
3,4,msd@redmail.com,Mahibhai,Dhoni,409,9,FEB
4,5,yog28c@gmail.com,Yogesh,Chatur,120,13,MAY
5,6,madhvisa@gmail.com,Madhvi,Auti,90,5,SEP
6,7,sachint@yahoo.com,Sachin,Tikkal,1112,50,APR
7,8,sagarv@hotmail.com,Sagar,Makode,170,12,NOV
8,9,sandip123@gmail.com,Sandip,Rana,590,30,DEC
9,10,davidwarnar1234@hotmail.com,Devid,Warnar,209,20,JUN
10,11,vp@gmail.com,Vishal,Pawar,110,10,JAN
11,12,rt@yahoo.com,Radhika,Tuwar,50,5,MAR
12,21,m.@gmail.com,Manda,Pawar,1190,40,JAN
13,22,m.@gmail.com,Manda,Pawar,1190,40,JAN

In [15]:
# To save this file into any format, like csv
a.to_csv("mydata.csv")

In [12]:
pd.read_sql("select id,concat(first_name, ' ', last_name) as FullName from students",mydb)

    id        FullName
0    1    Vishal Pawar
1    2   Radhika Tuwar
2    3    Anita Chavan
3    4  Mahibhai Dhoni
4    5   Yogesh Chatur
5    6     Madhvi Auti
6    7   Sachin Tikkal
7    8    Sagar Makode
8    9     Sandip Rana
9   10    Devid Warnar
10  11    Vishal Pawar
11  12   Radhika Tuwar
12  21     Manda Pawar
13  22     Manda Pawar

In [4]:
mydb = connection.connect(host = "localhost",database = 'lco_users',user = "root",passwd = "Vishal@9850",use_pure = True )

In [5]:
cur = mydb.cursor()
cur.execute("create table mydata( sr_no int(5),id int(5),email varchar(20),f_name varchar(10),l_name varchar(20),l_count int(5),c_count int(5),s_month varchar(20))")

ProgrammingError: 1050 (42S01): Table 'mydata' already exists

In [10]:
data = pd.read_csv("mydata.csv")

In [11]:
data.to_sql('mydata',mydb)

C:\Users\svish\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [12]:
import mysql.connector as connection
import pandas as pd
import csv

In [13]:
mydb = connection.connect(host = "localhost",database = 'lco_users',user = "root",passwd = "Vishal@9850",use_pure = True )
mydb

In [16]:
cur2 = mydb.cursor()

In [18]:
cur2.execute("create table lco_users.mydata1(id int(5),emailid varchar(20),f_name varchar(10),l_name varchar(20),l_count int(5),c_count int(5),s_month varchar(20))")

In [27]:
data = pd.read_csv('mydata.csv')

In [28]:
pwd()

'D:\\SQL'